In [157]:
# o que faremos hoje.

In [158]:
import pandas as pd

In [159]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [160]:
type(ufo)

pandas.core.frame.DataFrame

In [161]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [162]:
ufo['City']

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

In [163]:
type(ufo['City'])

pandas.core.series.Series

In [164]:
ufo['Colors Reported']

0        NaN
1        NaN
2        NaN
3        NaN
4        NaN
        ...
18236    NaN
18237    NaN
18238    NaN
18239    RED
18240    NaN
Name: Colors Reported, Length: 18241, dtype: object

In [165]:
ufo.City + ' , ' + ufo.State

0                      Ithaca , NY
1                 Willingboro , NJ
2                     Holyoke , CO
3                     Abilene , KS
4        New York Worlds Fair , NY
                   ...
18236              Grant Park , IL
18237             Spirit Lake , IA
18238             Eagle River , WI
18239             Eagle River , WI
18240                    Ybor , FL
Length: 18241, dtype: object

In [166]:
ufo['Location'] = ufo.City + ' , ' + ufo.State

In [167]:
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca , NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro , NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke , CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene , KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair , NY"

In [168]:
ufo = pd.read_csv('http://bit.ly/uforeports')
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [169]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry')
drinks

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,South America
189,Vietnam,111,2,1,2.0,Asia
190,Yemen,6,0,0,0.1,Asia
191,Zambia,32,19,4,2.5,Africa
192,Zimbabwe,64,18,4,4.7,Africa

In [170]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry')
drinks = drinks.sort_values(['total_litres_of_pure_alcohol', 'country', 'continent'], ascending=False)
count = world = 0
for index, row in drinks.iterrows():
    world += 1
    #if row['continent'] in 'Africa':
    if row['total_litres_of_pure_alcohol'] < drinks['total_litres_of_pure_alcohol'].mean():
        count += 1
        print(f'Posição mundial: {world} ', f'Posição regional: {count}   ',  row['total_litres_of_pure_alcohol'], f'litros/pessoa ', row['country'], ' ', row['continent'])

Posição mundial: 91  Posição regional: 1    4.7 litros/pessoa  Zimbabwe   Africa
Posição mundial: 92  Posição regional: 2    4.7 litros/pessoa  Swaziland   Africa
Posição mundial: 93  Posição regional: 3    4.6 litros/pessoa  Philippines   Asia
Posição mundial: 94  Posição regional: 4    4.6 litros/pessoa  Bosnia-Herzegovina   Europe
Posição mundial: 95  Posição regional: 5    4.4 litros/pessoa  Costa Rica   North America
Posição mundial: 96  Posição regional: 6    4.3 litros/pessoa  Burkina Faso   Africa
Posição mundial: 97  Posição regional: 7    4.2 litros/pessoa  Sao Tome & Principe   Africa
Posição mundial: 98  Posição regional: 8    4.2 litros/pessoa  Ecuador   South America
Posição mundial: 99  Posição regional: 9    4.2 litros/pessoa  Cuba   North America
Posição mundial: 100  Posição regional: 10    4.2 litros/pessoa  Colombia   South America
Posição mundial: 101  Posição regional: 11    4.1 litros/pessoa  Seychelles   Africa
Posição mundial: 102  Posição regional: 12    4.0 litros/pessoa  Cote d'Ivoire   Africa
Posição mundial: 103  Posição regional: 13    4.0 litros/pessoa  Cabo Verde   Africa
Posição mundial: 104  Posição regional: 14    3.9 litros/pessoa  Macedonia   Europe
Posição mundial: 105  Posição regional: 15    3.8 litros/pessoa  Bolivia   South America
Posição mundial: 106  Posição regional: 16    3.8 litros/pessoa  Armenia   Europe
Posição mundial: 107  Posição regional: 17    3.5 litros/pessoa  Nicaragua   North America
Posição mundial: 108  Posição regional: 18    3.4 litros/pessoa  Jamaica   North America
Posição mundial: 109  Posição regional: 19    3.1 litros/pessoa  Liberia   Africa
Posição mundial: 110  Posição regional: 20    3.0 litros/pessoa  Honduras   North America
Posição mundial: 111  Posição regional: 21    2.8 litros/pessoa  United Arab Emirates   Asia
Posição mundial: 112  Posição regional: 22    2.8 litros/pessoa  Lesotho   Africa
Posição mundial: 113  Posição regional: 23    2.6 litros/pessoa  Samoa   Oceania
Posição mundial: 114  Posição regional: 24    2.6 litros/pessoa  Mauritius   Africa
Posição mundial: 115  Posição regional: 25    2.5 litros/pessoa  Zambia   Africa
Posição mundial: 116  Posição regional: 26    2.5 litros/pessoa  Israel   Asia
Posição mundial: 117  Posição regional: 27    2.5 litros/pessoa  Guinea-Bissau   Africa
Posição mundial: 118  Posição regional: 28    2.4 litros/pessoa  Uzbekistan   Asia
Posição mundial: 119  Posição regional: 29    2.4 litros/pessoa  Kyrgyzstan   Asia
Posição mundial: 120  Posição regional: 30    2.4 litros/pessoa  Gambia   Africa
Posição mundial: 121  Posição regional: 31    2.3 litros/pessoa  Micronesia   Oceania
Posição mundial: 122  Posição regional: 32    2.3 litros/pessoa  DR Congo   Africa
Posição mundial: 123  Posição regional: 33    2.2 litros/pessoa  Turkmenistan   Asia
Posição mundial: 124  Posição regional: 34    2.2 litros/pessoa  Sri Lanka   Asia
Posição mundial: 125  Posição regional: 35    2.2 litros/pessoa  India   Asia
Posição mundial: 126  Posição regional: 36    2.2 litros/pessoa  Guatemala   North America
Posição mundial: 127  Posição regional: 37    2.2 litros/pessoa  El Salvador   North America
Posição mundial: 128  Posição regional: 38    2.2 litros/pessoa  Cambodia   Asia
Posição mundial: 129  Posição regional: 39    2.0 litros/pessoa  Vietnam   Asia
Posição mundial: 130  Posição regional: 40    2.0 litros/pessoa  Fiji   Oceania
Posição mundial: 131  Posição regional: 41    2.0 litros/pessoa  Bahrain   Asia
Posição mundial: 132  Posição regional: 42    1.9 litros/pessoa  Lebanon   Asia
Posição mundial: 133  Posição regional: 43    1.8 litros/pessoa  Kenya   Africa
Posição mundial: 134  Posição regional: 44    1.8 litros/pessoa  Ghana   Africa
Posição mundial: 135  Posição regional: 45    1.8 litros/pessoa  Central African Republic   Africa
Posição mundial: 136  Posição regional: 46    1.7 litros/pessoa  Sudan   Africa
Posição mundial: 137  Posição regional: 47    1.7 litros/pessoa  Congo   Africa
Posição mundial: 138  Posição regional: 48    1.5 litros/pessoa  Singapore   Asia
Posição mundial: 139  Posição regional: 49    1.5 litros/pessoa  Papua New Guinea   Oceania
Posição mundial: 140  Posição regional: 50    1.5 litros/pessoa  Malawi   Africa
Posição mundial: 141  Posição regional: 51    1.4 litros/pessoa  Turkey   Asia
Posição mundial: 142  Posição regional: 52    1.3 litros/pessoa  Tunisia   Africa
Posição mundial: 143  Posição regional: 53    1.3 litros/pessoa  Togo   Africa
Posição mundial: 144  Posição regional: 54    1.3 litros/pessoa  Mozambique   Africa
Posição mundial: 145  Posição regional: 55    1.3 litros/pessoa  Azerbaijan   Europe
Posição mundial: 146  Posição regional: 56    1.2 litros/pessoa  Solomon Islands   Oceania
Posição mundial: 147  Posição regional: 57    1.1 litros/pessoa  Tonga   Oceania
Posição mundial: 148  Posição regional: 58    1.1 litros/pessoa  Djibouti   Africa
Posição mundial: 149  Posição regional: 59    1.1 litros/pessoa  Benin   Africa
Posição mundial: 150  Posição regional: 60    1.0 litros/pessoa  Tuvalu   Oceania
Posição mundial: 151  Posição regional: 61    1.0 litros/pessoa  Syria   Asia
Posição mundial: 152  Posição regional: 62    1.0 litros/pessoa  Nauru   Oceania
Posição mundial: 153  Posição regional: 63    1.0 litros/pessoa  Kiribati   Oceania
Posição mundial: 154  Posição regional: 64    0.9 litros/pessoa  Vanuatu   Oceania
Posição mundial: 155  Posição regional: 65    0.9 litros/pessoa  Qatar   Asia
Posição mundial: 156  Posição regional: 66    0.8 litros/pessoa  Madagascar   Africa
Posição mundial: 157  Posição regional: 67    0.7 litros/pessoa  Oman   Asia
Posição mundial: 158  Posição regional: 68    0.7 litros/pessoa  Ethiopia   Africa
Posição mundial: 159  Posição regional: 69    0.7 litros/pessoa  Algeria   Africa
Posição mundial: 160  Posição regional: 70    0.6 litros/pessoa  Mali   Africa
Posição mundial: 161  Posição regional: 71    0.6 litros/pessoa  Brunei   Asia
Posição mundial: 162  Posição regional: 72    0.5 litros/pessoa  Morocco   Africa
Posição mundial: 163  Posição regional: 73    0.5 litros/pessoa  Jordan   Asia
Posição mundial: 164  Posição regional: 74    0.5 litros/pessoa  Eritrea   Africa
Posição mundial: 165  Posição regional: 75    0.4 litros/pessoa  Chad   Africa
Posição mundial: 166  Posição regional: 76    0.4 litros/pessoa  Bhutan   Asia
Posição mundial: 167  Posição regional: 77    0.3 litros/pessoa  Tajikistan   Asia
Posição mundial: 168  Posição regional: 78    0.3 litros/pessoa  Senegal   Africa
Posição mundial: 169  Posição regional: 79    0.3 litros/pessoa  Malaysia   Asia
Posição mundial: 170  Posição regional: 80    0.2 litros/pessoa  Nepal   Asia
Posição mundial: 171  Posição regional: 81    0.2 litros/pessoa  Iraq   Asia
Posição mundial: 172  Posição regional: 82    0.2litros/pessoa  Guinea   Africa
Posição mundial: 173  Posição regional: 83    0.2 litros/pessoa  Egypt   Africa
Posição mundial: 174  Posição regional: 84    0.1 litros/pessoa  Yemen   Asia
Posição mundial: 175  Posição regional: 85    0.1 litros/pessoa  Timor-Leste   Asia
Posição mundial: 176  Posição regional: 86    0.1 litros/pessoa  Saudi Arabia   Asia
Posição mundial: 177  Posição regional: 87    0.1 litros/pessoa  Niger   Africa
Posição mundial: 178  Posição regional: 88    0.1 litros/pessoa  Myanmar   Asia
Posição mundial: 179  Posição regional: 89    0.1 litros/pessoa  Indonesia   Asia
Posição mundial: 180  Posição regional: 90    0.1 litros/pessoa  Comoros   Africa
Posição mundial: 181  Posição regional: 91    0.0 litros/pessoa  Somalia   Africa
Posição mundial: 182  Posição regional: 92    0.0 litros/pessoa  San Marino   Europe
Posição mundial: 183  Posição regional: 93    0.0 litros/pessoa  Pakistan   Asia
Posição mundial: 184  Posição regional: 94    0.0 litros/pessoa  North Korea   Asia
Posição mundial: 185  Posição regional: 95    0.0 litros/pessoa  Monaco   Europe
Posição mundial: 186  Posição regional: 96    0.0 litros/pessoa  Mauritania   Africa
Posição mundial: 187  Posição regional: 97    0.0 litros/pessoa  Marshall Islands   Oceania
Posição mundial: 188  Posição regional: 98    0.0 litros/pessoa  Maldives   Asia
Posição mundial: 189  Posição regional: 99    0.0 litros/pessoa  Libya   Africa
Posição mundial: 190  Posição regional: 100    0.0 litros/pessoa  Kuwait   Asia
Posição mundial: 191  Posição regional: 101    0.0 litros/pessoa  Iran   Asia
Posição mundial: 192  Posição regional: 102    0.0 litros/pessoa  Bangladesh   Asia
Posição mundial: 193  Posição regional: 103    0.0 litros/pessoa  Afghanistan   Asia

In [171]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry', dtype = {'total_litres_of_pure_alcohol': str})
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [172]:
chip = pd.read_table('http://bit.ly/chiporders')
chip

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
...,...,...,...,...,...
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

In [173]:
chip['item_price'].str.replace('$', '').astype(float).mean()

7.464335785374297

In [182]:
chip['item_name'] = chip['item_name'].str.upper()
chip['item_name'].str.contains('CHICKEN').astype(int)

0       0
1       0
2       0
3       0
4       1
       ..
4617    0
4618    0
4619    1
4620    1
4621    1
Name: item_name, Length: 4622, dtype: int32